navaro/CHIBIOSHAL-STM32U5/ports/STM32/LLD/USARTv2/hal_uart_lld.c
#if STM32_UART_USE_USART2
    if (&UARTD2 == uartp) {
      rccDisableUSART2();
      return;
    }
#endif

#if STM32_UART_USE_USART3
    if (&UARTD3 == uartp) {
      rccDisableUSART3();
      return;
    }
#endif

#if STM32_UART_USE_UART4
    if (&UARTD4 == uartp) {
      rccDisableUART4();
      return;
    }
#endif

#if STM32_UART_USE_UART5
    if (&UARTD5 == uartp) {
      rccDisableUART5();
      return;
    }
#endif

#if STM32_UART_USE_USART6
    if (&UARTD6 == uartp) {
      rccDisableUSART6();
      return;
    }
#endif

#if STM32_UART_USE_UART7
    if (&UARTD7 == uartp) {
      rccDisableUART7();
      return;
    }
#endif

#if STM32_UART_USE_UART8
    if (&UARTD8 == uartp) {
      rccDisableUART8();
      return;
    }
#endif
  }
}

/**
 * @brief   Starts a transmission on the UART peripheral.
 * @note    The buffers are organized as uint8_t arrays for data sizes below
 *          or equal to 8 bits else it is organized as uint16_t arrays.
 *
 * @param[in] uartp     pointer to the @p UARTDriver object
 * @param[in] n         number of data frames to send
 * @param[in] txbuf     the pointer to the transmit buffer
 *
 * @notapi
 */
void uart_lld_start_send(UARTDriver *uartp, size_t n, const void *txbuf) {
#if defined CFG_G5_PDU && CFG_G5_PDU
  _DEnRE_set (uartp, true) ;
#endif
#if defined(STM32U5) // STM32U5 PORT
  dmaStreamDisable(uartp->dmatx);
#endif
  /* TX DMA channel preparation.*/
#if !defined(STM32U5) // STM32U5 PORT
  dmaStreamSetMemory0(uartp->dmatx, txbuf);
  dmaStreamSetTransactionSize(uartp->dmatx, n);
  dmaStreamSetMode(uartp->dmatx, uartp->dmatxmode  | STM32_DMA_CR_DIR_M2P |
                                 STM32_DMA_CR_MINC | STM32_DMA_CR_TCIE);
#else
  uartp->dmatx->stream->CTR1 = (uartp->dmatx->stream->CTR1 | DMA_CTR1_SINC) &
		  	  	  	  	  	  ~DMA_CTR1_DINC ;
  uartp->dmatx->stream->CTR2 = (uartp->dmatx->stream->CTR2 | DMA_CTR2_DREQ) &
		  	  	  	  	  	  ~(DMA_CTR2_SWREQ);
  uartp->dmatx->stream->CCR  |= DMA_CCR_TCIE|DMA_CCR_DTEIE|
		  	  	  	   DMA_CCR_ULEIE|DMA_CCR_USEIE;
  uartp->dmatx->stream->CSAR = (uint32_t)txbuf ;
  uartp->dmatx->stream->CBR1  = (uint32_t)(n);
#endif
  /* Only enable TC interrupt if there's a callback attached to it or
     if called from uartSendFullTimeout(). Also we need to clear TC flag
     which could be set before.*/
#if UART_USE_WAIT == TRUE
  if ((uartp->config->txend2_cb != NULL) || (uartp->early == false)) {
#else
  if (uartp->config->txend2_cb != NULL) {
#endif
    uartp->usart->ICR = USART_ICR_TCCF;
    uartp->usart->CR1 |= USART_CR1_TCIE;
  }

  /* Starting transfer.*/
  dmaStreamEnable(uartp->dmatx);
}

/**
 * @brief   Stops any ongoing transmission.
 * @note    Stopping a transmission also suppresses the transmission callbacks.
 *
 * @param[in] uartp     pointer to the @p UARTDriver object
 *
 * @return              The number of data frames not transmitted by the
 *                      stopped transmit operation.
 *
 * @notapi
 */
size_t uart_lld_stop_send(UARTDriver *uartp) {

  dmaStreamDisable(uartp->dmatx);
#if defined(STM32U5) // STM32U5 PORT
  USART_TypeDef *u = uartp->usart ;
  u->CR1 &=  ~USART_CR1_TCIE;
#endif
  return dmaStreamGetTransactionSize(uartp->dmatx);
}

/**
 * @brief   Starts a receive operation on the UART peripheral.
 * @note    The buffers are organized as uint8_t arrays for data sizes below
 *          or equal to 8 bits else it is organized as uint16_t arrays.
 *
 * @param[in] uartp     pointer to the @p UARTDriver object
 * @param[in] n         number of data frames to send
 * @param[out] rxbuf    the pointer to the receive buffer
 *
 * @notapi
 */
void uart_lld_start_receive(UARTDriver *uartp, size_t n, void *rxbuf) {
#if defined CFG_G5_PDU && CFG_G5_PDU
  _DEnRE_set (uartp, false) ;
#endif
  /* Stopping previous activity (idle state).*/
  dmaStreamDisable(uartp->dmarx);
#if !defined(STM32U5) // STM32U5 PORT
  /* RX DMA channel preparation.*/
  dmaStreamSetMemory0(uartp->dmarx, rxbuf);
  dmaStreamSetTransactionSize(uartp->dmarx, n);
  dmaStreamSetMode(uartp->dmarx, uartp->dmarxmode  | STM32_DMA_CR_DIR_P2M |
                                 STM32_DMA_CR_MINC | STM32_DMA_CR_TCIE);
#else
  uartp->dmarx->stream->CTR1 = (uartp->dmarx->stream->CTR1 | DMA_CTR1_DINC) &
		  	  	  	  	  	  ~DMA_CTR1_SINC ;
  uartp->dmarx->stream->CTR2  &= ~(DMA_CTR2_SWREQ|DMA_CTR2_DREQ);
  uartp->dmarx->stream->CCR  |= DMA_CCR_TCIE|DMA_CCR_DTEIE|
		  	  	  	  DMA_CCR_ULEIE|DMA_CCR_USEIE;
  uartp->dmarx->stream->CDAR = (uint32_t)rxbuf ;
  uartp->dmarx->stream->CBR1  = (uint32_t)(n);
#endif
  /* Starting transfer.*/
  dmaStreamEnable(uartp->dmarx);
}

/**
 * @brief   Stops any ongoing receive operation.
 * @note    Stopping a receive operation also suppresses the receive callbacks.
 *
 * @param[in] uartp     pointer to the @p UARTDriver object
 *
 * @return              The number of data frames not received by the
 *                      stopped receive operation.
 *
 * @notapi
 */
size_t uart_lld_stop_receive(UARTDriver *uartp) {
  size_t n;

  dmaStreamDisable(uartp->dmarx);
  n = dmaStreamGetTransactionSize(uartp->dmarx);
#if 0 
  uart_enter_rx_idle_loop(uartp);
#endif

  return n;
}

/**
 * @brief   USART common service routine.
 *
 * @param[in] uartp     pointer to the @p UARTDriver object
 */
void uart_lld_serve_interrupt(UARTDriver *uartp) {
  uint32_t isr;
  USART_TypeDef *u = uartp->usart;
  uint32_t cr1 = u->CR1;

  /* Reading and clearing status.*/
  isr = u->ISR;
  u->ICR = isr;

  if (isr & (USART_ISR_LBDF | USART_ISR_ORE | USART_ISR_NE |
             USART_ISR_FE   | USART_ISR_PE)) {
#if !defined(STM32U5) // STM32U5 PORT
    _uart_rx_error_isr_code(uartp, translate_errors(isr));
#else
    _rx_error_isr_code(uartp, translate_errors(isr));
#endif
  }

  if ((isr & USART_ISR_TC) && (cr1 & USART_CR1_TCIE)) {
    /* TC interrupt disabled.*/
    u->CR1 = cr1 & ~USART_CR1_TCIE;

    /* End of transmission, a callback is generated.*/
#if !defined(STM32U5) // STM32U5 PORT
    _uart_tx2_isr_code(uartp);
#else
    _tx2_isr_code(uartp);
#endif

  }

  /* Timeout interrupt sources are only checked if enabled in CR1.*/
  if (((cr1 & USART_CR1_IDLEIE) && (isr & USART_ISR_IDLE)) ||
      ((cr1 & USART_CR1_RTOIE) && (isr & USART_ISR_RTOF))) {
    _uart_timeout_isr_code(uartp);
  }
}

#endif /* HAL_USE_UART */

/** @} */
